Repository: sambar-fgfs/Kanboard-documentation-ja
Catalog: resource/kanboard-documentation-ja.tmx
Source language: en_us
Languages: ja

source: Basically that allow you to extend the default fields without having to create new tables.
ja: これは基本的に、新しいテーブルを作らずにデフォルトのフィールドを拡張することを許容します。

source: // Enable LDAP START_TLS define('LDAP_START_TLS', false);
ja: // LDAP START_TLS を有効にする define('LDAP_START_TLS', false);

source: - Project feeds contains only the activity the project
ja: - プロジェクトのRSS/Atomフィードはプロジェクトの活動状況のみを配信します。

source: Brute Force Protection ----------------------
ja: 総当たり攻撃からの保護 ----------------------

source: // LDAP username pattern to use with user mode
ja: // userモードで使用する LDAPユーザー名のパターン

source: Security ========
ja: セキュリティ ========

source: Attribute: **created**
ja: 属性: **created**

source: - Improve the documentation
ja: - 文書の改良

source: - Result on success: **project_id**
ja: - 成功時の返り値: **project_id**

source: - Fix bugs
ja: - バグ修正

source: This configuration require the `Rewrite module for IIS <http://www.iis.net/learn/extensions/url-rewrite-module/using-the-url-rewrite-module>`__.
ja: この設定には `Rewrite module for IIS <http://www.iis.net/learn/extensions/url-rewrite-module/using-the-url-rewrite-module>`__ が必要になります。

source: The issue caused can be a blank page or an Apache crash:
ja: この問題はApacheのクラッシュか空白のページを引き起こします:

source: User Calendars --------------
ja: ユーザーのカレンダー --------------

source: - Inactive swimlanes are not shown on the board.
ja: - 使用していないスイムレーンはボードに表示されません。

source: - Lower than or equal: **due:<=2015-06-29**
ja: - 指定日以前: **due:<=2015-06-29**

source: If you don’t have the rewrite module, you will get an internal server error (500) from IIS.
ja: このRewriteモジュールが無い場合、IISは Internal Server Error (500) を返します。

source: - Use lead and cycle time to measure performance
ja: - パフォーマンスの測定にはリードタイム・サイクルタイムを使用

source: There are several email transports available:
ja: 複数のEmailの配送方法が利用可能です:

source: SELinux restrictions --------------------
ja: SELinux の制限 --------------------

source: - You can choose to synchronize the calendar with iCloud to be available across all your devices
ja: - 利用可能な全てのデバイスをiCloudでカレンダーを同期するか選択できます。

source: Recruiting Process ~~~~~~~~~~~~~~~~~~
ja: 採用プロセス ~~~~~~~~~~~~~~~~~~

source: - **file_id** (integer, required)
ja: - **file_id** (integer, 必須)

source: # cleanup
ja: # クリーンアップ

source: Task details are also available in read-only mode.
ja: タスクの詳細も、閲覧のみ可能です。

source: Kanboard is a free and open source Kanban project management software.
ja: Kanboard は自由でオープンソースな、かんばんプロジェクト管理ソフトウェアです。

source: - Purpose: **Remove a file associated to a project**
ja: - 用途: **プロジェクトに関連するファイルを削除する**

source: - Composer
ja: - コンポーザー

source: Kanban vs Todo lists --------------------
ja: かんばん vs Todo リスト --------------------

source: Provider Registration ---------------------
ja: プロバイダの登録 ---------------------

source: Here an example to override formatter objects in Kanboard:
ja: これは、Kanboardでフォーマッターオブジェクトをオーバーライドする例です:

source: // Enable/disable reverse proxy authentication define('REVERSE_PROXY_AUTH', true); // Set this value to true
ja: // リバースプロキシ認証を有効/無効にする define('REVERSE_PROXY_AUTH', true); // この値をtrueにしてください。

source: In your ``initialize()`` method you need to call the method ``on()`` of the class ``Kanboard\Core\Plugin\Hook``:
ja: ``initialize()`` メソッド内で、``Kanboard\Core\Plugin\Hook`` クラス内の ``on()`` メソッドを呼ぶ必要があります:

source: warning:: **This feature doesn’t work with all browsers.** It does not work with Safari due to this bug: `<https://bugs.webkit.org/show_bug.cgi?id=49141>`_
ja: 警告:: **この機能は一部のブラウザで動作しません.** Safari `<https://bugs.webkit.org/show_bug.cgi?id=49141>`_ では、左記のバグにより動作しません。

source: - Purpose: **Get the last 100 events for the logged user**
ja: - 用途: **ログインしたユーザーで、最後の100個のイベントを取得**

source: - Close the task
ja: - タスクを完了する

source: - After 6 authentication failure, the user account is locked for a period of 15 minutes.
ja: - 6回認証に失敗した後は、15分間アカウントがロックされます。

source: Analytics ---------
ja: 分析 ---------

source: However, it’s possible to switch to the compact the view to display all columns in your screen.
ja: しかしながら、コンパクトビューに切り替えることですべてのカラムを画面上に表示できるでしょう。

source: This is the default configuration:
ja: これはデフォルトでの設定です:

source: - Plugins installed via the web interface are stored on the local filesystem.
ja: - webインターフェース経由でインストールされたプラグインはローカルファイルシステム上に保存されます。

source: Search by task link ~~~~~~~~~~~~~~~~~~~
ja: タスクリンクで検索 ~~~~~~~~~~~~~~~~~~~

source: - Only for tasks created by you and assigned to you
ja: - 自分が作成した自分のタスクのみ

source: Attribute: **creator**
ja: 属性: **creator**

source: By default, only plugin listed on Kanboard’s website are available.
ja: デフォルトでは、プラグインの一覧にあるのはKanboardのwebサイトで利用可能なものだけです。

source: - Publishing a mobile application on a store (App Store/Play Store) is not free, you have to pay, even if your software is free.
ja: - 無料のソフトウェアであっても、モバイルアプリをストア(App Store/Play Store)で配布するのには費用が掛かり、配布者が支払わなければなりません。

source: From your Kanboard directory, run the command ``phpunit -c tests/units.sqlite.xml``.
ja: Kanboardのディレクトリから、``phpunit -c tests/units.sqlite.xml`` コマンドを実行してください。

source: - ``LDAP_GROUP_FILTER``: LDAP filter used to perform the query
ja: - ``LDAP_GROUP_FILTER``: LDAP フィルターを使用するために実行するクエリ

source: This query will use the same value as the board highlight period configured in settings.
ja: このクエリは設定内のタスクのハイライト期間と同じ値を使用します。

source: Do that first 2.
ja: 最初にやること 2.

source: Example to add a new stylesheet:
ja: 新しいスタイルシートを追加する例:

source: There are two types of projects:
ja: プロジェクトには2つのタイプがあります:

source: - **position** (integer, required)
ja: - **position** (integer, 必須)

source: note:: Since Kanboard v1.2.8, people with two-factor authentication enabled must use API keys.
ja: 注意:: Kanboard v1.2.8以降では、二要素認証を有効にするにはAPIキーを使用しなければなりません。

source: - Measure
ja: - 測定

source: Role assignments are visible in **Project Settings > Permissions**:
ja: 役割の割当ては **このプロジェクトの設定 > 権限** で見ることができます:

source: You can also rename the file ``config.default.php`` to ``config.php`` and change the desired values.
ja: また、``config.default.php``から、``config.php``にリネームすることでも、希望する設定値にできます。.

source: - View the last activities of the project.
ja: - 最近のプロジェクトの活動状況が見えます。

source: You can also display the overdue tasks with the flag ``--show``:
ja: また、``--show``フラグを使用することで、期限切れタスクを表示することもできます。

source: - Report bugs
ja: - バグ報告

source: On the left, click on **Two Factor Authentication** and click on the button 3.
ja: 左の **二要素認証** をクリックし、「二要素認証を有効にする」ボタンをクリックする 3.

source: For each project you are a member, you can choose to receive notifications for:
ja: 各々のプロジェクトのメンバーは、受け取る通知を以下から選択できます。:

source: I want to set the start date automatically when the task is moved to the column “Work in progress” ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: タスクがカラム"Work in progress"に移動された時、自動的に開始日をセットしたい ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: figure:: /_static/task-creation-form.png :alt: Task creation form
ja: figure:: /_static/task-creation-form.png :alt: タスク作成フォーム

source: Only projects where you are members will be shown in the drop-down.
ja: ドロップダウンには、あなたがメンバーになっているプロジェクトのみが表示されます。

source: notification
ja: 通知

source: - ``LdapUserProvider`` for a LDAP user
ja: - ``LdapUserProvider`` はLDAPのユーザーの情報を提供します。

source: Several abstract methods must be implemented by yourself:
ja: いくつかの抽象化メソッドはあなた自身で実装しなければなりません:

source: Page not found and the URL seems wrong (&amp;) ----------------------------------------------
ja: URLが間違っていて、Page not found が出る (&amp;) ----------------------------------------------

source: PHP installation ~~~~~~~~~~~~~~~~
ja: PHP のインストール ~~~~~~~~~~~~~~~~

source: Use a backtick.
ja: バッククォート(``)を使用します。

source: - If you have a real reverse proxy, the `HTTP ICAP draft <http://tools.ietf.org/html/draft-stecher-icap-subid-00#section-3.4>`__ proposes the header to be ``X-Authenticated-User``.
ja: - 本物のリバースプロキシを持っている場合、`HTTP ICAP draft <http://tools.ietf.org/html/draft-stecher-icap-subid-00#section-3.4>`__ が提案するヘッダーは ``X-Authenticated-User`` です。

source: Build stylesheets:
ja: スタイルシートのビルド:

source: - Web Link: You copy and paste a link and Kanboard will fetch the page title automatically
ja: - Web リンク: リンクをコピー・ペーストするとKanboardはページのタイトルを自動的に取得します

source: API endpoint ------------
ja: API エンドポイント ------------

source: - Find tasks into several links: ``link:"is a milestone of" link:"relates to"``
ja: - 複数のタスクリンクで検索: ``link:"is a milestone of" link:"relates to"``

source: If you would like to change this behavior, use this config parameter:
ja: この挙動を変更したい場合、この設定パラメータを使用してください:

source: Running the Container ---------------------
ja: コンテナを実行する ---------------------

source: Windows Server and IIS ----------------------
ja: Windows Server と IIS ----------------------

source: // API alternative authentication header, the default is HTTP Basic Authentication defined in RFC2617
ja: // 代替のAPI認証ヘッダ。デフォルトはRFC2617で定義されたHTTP Basic認証。

source: - Purpose: **Rename a tag**
ja: - 用途: **タグの名前を変更する**

source: warning:: The background worker is not really maintained anymore.
ja: 警告:: バックグラウンドワーカーは本当に誰もメンテナンスしていません。

source: Each movement of a task between columns is recorded in the database.
ja: カラム間でタスクを移動する都度データベースに記録されます。

source: - Each task records the task id of the parent task that created it and the child task created
ja: - 親タスクと、生成された子タスクは、IDをそれぞれに記録します。

source: - Choose action: **Automatically update the start date**
ja: - アクション: **開始日を自動的に更新** を選択

source: From the project settings, click on the left on the menu **Custom Roles** and at the top of the page click on **Add a new custom role**.
ja: プロジェクト設定から、左のメニューの **独自の役割**をクリックし、ページ上部の **新しい役割を追加** をクリックしてください。

source: - Result on success: **link_id**
ja: - 成功時の返り値: **link_id**

source: Request example to fetch metada of a task by name:
ja: 名前からタスクのメタデータを取得するリクエストの例:

source: - Result on success: **List of tasks**
ja: - 成功時の返り値: **タスクのリスト**

source: - Do not forget to change the default user/password
ja: - デフォルトのユーザー名/パスワードの変更を忘れないようにしてください。

source: Go to the menu **Settings**, then choose **Calendar settings** on the left.
ja: メニューの **設定** を開いてから、左側の **カレンダー設定** を選択してください。

source: When public access is enabled, a couple of links are generated:
ja: 公開アクセスを有効にすると、これらのリンクの組み合わせが生成されます:

source: - If migration generate an error, a rollback is performed
ja: - 万が一マイグレーションでエラーが起きた場合、ロールバックが行われます。

source: Kanboard uses the library `Symfony Console <http://symfony.com/doc/current/components/console/introduction.html>`__ to handle local command lines.
ja: Kanboard は `Symfony Console <http://symfony.com/doc/current/components/console/introduction.html>`__ ライブラリをローカルのコマンドラインのハンドルに使用しています。

source: This is especially useful for taking screenshots to describe an issue for example.
ja: 例えばissueを説明する際にスクリーンショットを取る時に特に便利です。

source: warning:: Microsoft Internet Explorer is not supported since version 1.2.11
ja: 警告:: v1.2.11以降ではMicrosoft Internet Explorer がサポートされません。

source: Language ~~~~~~~~
ja: 言語 ~~~~~~~~

source: - Find all tasks that have those categories: ``category:"Bug" category:"Improvements"``
ja: - これらのカテゴリに該当する全てのタスクを検索: ``category:"Bug" category:"Improvements"``

source: Response from the server:
ja: サーバーからのレスポンス:

source: user
ja: ユーザー

source: - Original Javascript code is stored in the folder ``assets/js/src/*.js``
ja: - オリジナルのJavascriptファイルは ``assets/js/src/*.js`` です。

source: Interface ---------
ja: インターフェース ---------

source: - Example: ``title:"My task"``
ja: - 例: ``title:"My task"``

source: Kanboard executes database migrations automatically for you.
ja: Kanboard は自動的にデータベースのマイグレーションを行います。

source: Examples --------
ja: 例 --------

source: // We choose "sendmail" as mail transport
ja: // "sendmail" をメール送信方法として選択する

source: - Access to all procedures
ja: - 全てのプロシージャにアクセスできる

source: +-------------+--------------------------------------------------------+ | Role | Description | +=============+========================================================+ | Project | Can change project settings, access to the Gantt chart | | Manager | and reports | +-------------+--------------------------------------------------------+ | Project | Can create tasks and use the board | | Member | | +-------------+--------------------------------------------------------+ | Project | Read-only access to the board and tasks | | Viewer | | +-------------+--------------------------------------------------------+
ja: +-------------+--------------------------------------------------------+ | 役割 | 概要 | +=============+========================================================+ | プロジェクト | プロジェクト設定を変更でき、 | | 管理者 | ガントチャートと 分析へアクセス可能 | +-------------+--------------------------------------------------------+ | プロジェクト | タスクの作成と、ボードの使用が可能 | | メンバー | | +-------------+--------------------------------------------------------+ | プロジェクト | ボードとタスクの閲覧のみ可能 | | ビューアー | | +-------------+--------------------------------------------------------+

source: - Scrum has pre-defined roles like scrum master, product owners and the team
ja: - スクラムでは、スクラムマスター、プロダクトオーナー、チームといったような規定の役割があります

source: - Properties that returns an empty string won’t be synced
ja: - プロパティの返り値が空の文字列の場合、同期されないでしょう。

source: This is a basic example using Spring.
ja: Spring を使用する基本的な例です。

source: - Choose the event: **Closing a task**
ja: - イベント: **タスクを完了する** を選択

source: Depending on the plugins you install, communicating to external services can take hundred of milliseconds or even seconds.
ja: インストールしたプラグインによっては、外部サービスとの通信に数百ミリ秒から数秒掛かります。

source: - Scrum board is cleared between sprints
ja: - スクラムボードはスプリント間で白紙化されます。

source: Cron Job ========
ja: Cron ジョブ ========

source: - Result on success: **list of actions**
ja: - 成功時の返り値: **自動アクションの一覧**

source: - Limit your work in progress
ja: - 仕掛の制限 (訳注:元ネタでは「仕掛在庫の削減」に重点を置く)

source: How to display a link to the task in notifications?
ja: どうすれば通知にタスクへのリンクを表示できますか?

source: Horizontal Scrolling and Compact Mode -------------------------------------
ja: 横スクロールモードとコンパクトビュー -------------------------------------

source: - **color_id** (string, optional)
ja: - **color_id** (string, 任意)

source: For example, Microsoft Active Directory doesn’t allow anonymous browsing by default and if you don’t want to use a proxy user you can use this method.
ja: 例えば、Microsoft Active Directoryはデフォルトではanonymousブラウジングを許容していませんが、proxyユーザーを使用したくない場合にこの方法が使用できます。

source: This issue comes from your PHP configuration, the value of ``arg_separator.output`` is not the PHP’s default, there is different ways to fix that:
ja: この問題はPHPの設定が原因で、 ``arg_separator.output`` がPHPのデフォルト値で無い場合に発生し、これを修正するには別の方法があります:

source: Go to the task view and choose **Move to another project**.
ja: タスクビューを開いてから、 **別プロジェクトに移動** を選択してください。

source: Webhooks are useful to perform actions with external applications.
ja: Webhooks は外部アプリケーションと共にアクションを実行するのに有用です。.

source: - **opposite_task_id** (integer, required)
ja: - **opposite_task_id** (integer, 必須)

source: Each task has an analytics section available from the left menu in the task view.
ja: 各々のタスクはタスクビューの左メニューから、分析セクションが利用可能です。

source: To tell PHP to use LDAPS, you need to prefix the name of your LDAP server with “ldaps://”, as in the example below:
ja: PHP に LDAPS 使用を指示するために、後述する例のようにLDAPサーバーの前に "ldaps://" のプレフィックスを付ける必要があります。

source: To avoid blocking the main thread, it’s possible to delegate these operations to a pool of background workers.
ja: メインのスレッドの妨害を避けるため、これらの動作をバックグラウンドワーカーに委任することができます。

source: Custom Project Roles --------------------
ja: プロジェクト独自の役割 --------------------

source: By default, Kanboard will use the bundled PHP mail function to send emails.
ja: デフォルトでは、KanboardはPHPにバンドルされているメール機能をEmailの送信に利用します。

source: Installation on RedHat/Centos/Oracle Linux Enterprise =====================================================
ja: RHEL/Centos/Oracle Linux Enterprise へのインストール =====================================================

source: Give a name to the role and submit the form.
ja: 役割に名前をつけて保存してください。

source: - The assignee
ja: - 担当者

source: - The start date and end date are used to generate the project Gantt chart.
ja: - 開始日と終了日はプロジェクトのガントチャートを生成するのに使用されます。

source: // MySQL parameters define('DB_USERNAME', 'REPLACE_ME'); define('DB_PASSWORD', 'REPLACE_ME'); define('DB_HOSTNAME', 'REPLACE_ME'); define('DB_NAME', 'kanboard');
ja: // SQLサーバーのパラメータ define('DB_USERNAME', 'REPLACE_ME'); define('DB_PASSWORD', 'REPLACE_ME'); define('DB_HOSTNAME', 'REPLACE_ME'); define('DB_NAME', 'kanboard');

source: There are 3 types of roles for projects:
ja: プロジェクト内での役割は、この3つがあります:

source: If you override an existing class, you will change the default behavior.
ja: 既存のクラスをオーバーライドすれば、デフォルトの挙動を変更できます。

source: figure:: /_static/apple-calendar-edit-subscription.png :alt: Edit iCal subscription
ja: figure:: /_static/apple-calendar-edit-subscription.png :alt: iCal サブスクリプションを編集

source: - Fixed
ja: - 修正完了

source: Email configuration -------------------
ja: Email の設定 -------------------

source: figure:: /_static/2fa.png :alt: 2FA
ja: figure:: /_static/2fa.png :alt: 二要素認証

source: // Remove a metadata from a project
ja: // プロジェクトからメタデータを削除する

source: Notification Handler --------------------
ja: 通知のハンドラ --------------------

source: - The @username mention is linked to the public user profile.
ja: - @username での言及は、公開プロフィールとリンクされます。

source: Attribute: **category**
ja: 属性: **category**

source: - Modern Linux or Unix operating system with the latest version of PHP.
ja: - 最新版のPHPをインストールした現代的なLinux/Unix OSを使用する。

source: Login and check if everything is ok
ja: ログインして、全て問題が無いか確認する。

source: - Find tasks by project name: ``project:"My project name"``
ja: - プロジェクト名で検索: ``project:"My project name"``

source: To rename a project, just click on the link entitled **"Edit project"** on the left.
ja: プロジェクトの名前を変えるには、単に左側の **プロジェクトの編集** をクリックしてください。

source: - Query to search by color id: ``color:blue``
ja: - 色IDで検索: ``color:blue``

source: - Purpose: **Set a task to the status open**
ja: - 用途: **タスクの状態をオープンにする**

source: - Bug triage takes a lot of time.
ja: - バグの切り分けには多くの時間が掛かります。

source: By default, SQL migrations are executed automatically.
ja: デフォルトでは、SQLマイグレーションは自動的に実行されます。

source: - Purpose: **Start subtask timer for a user**
ja: - 用途: **サブタスクのタイマーをスタートする**

source: LDAP Configuration Examples ===========================
ja: LDAP 設定例 ===========================

source: Authentication Workflow -----------------------
ja: 認証のワークフロー -----------------------

source: More details regarding portsnap can be found in the `FreeBSD Handbook <https://www.freebsd.org/doc/handbook/ports-using.html>`__.
ja: portsnapについての更なる詳細は `FreeBSD Handbook <https://www.freebsd.org/doc/handbook/ports-using.html>`__ にあります。

source: - Mail (PHP mail function)
ja: - Mail (PHP mail 関数)

source: - Purpose: **Get the a swimlane by id**
ja: - Purpose: **スイムレーンをIDから取得する**

source: The database is recreated for each execution.
ja: 実行の都度データベースは再度生成されます。

source: - **email** (string, optional)
ja: - **email** (string, 任意)

source: - Go to the search box = **f**
ja: - 検索ボックスに移動 = **f**

source: - **status** (integer, optional)
ja: - **status** (integer, 任意)

source: - Actions
ja: - アクション

source: Date separator ``..`` (two dots)
ja: ``..`` (2つのドット)でデータを区切ってください。

source: - Custom filters are stored by project and associated to the creator.
ja: - カスタムフィルターは作成者に関連付けられてプロジェクトに保存されます。

source: If the LDAP authentication is successful, by default a local user is created automatically with no password and marked as LDAP users.
ja: LDAP認証が成功した場合、デフォルトではLDAPユーザーとしてマークされ、パスワード不要でログイン出来るローカルユーザーが自動的に作成されます。

source: In this way you can still get notified without having to receive emails.
ja: これにより、Emailを受け取る事なく通知を取得できます。

source: Show sub-tasks based on the time tracking:
ja: サブタスクを時間の追跡に基いて表示する:

source: To show the column again, click on the "plus icon".
ja: カラムを表示するよう戻すには、"「+」アイコン"をクリックしてください。

source: Go to http://your.server.domain.tld/kanboard and enjoy!
ja: http://your.server.domain.tld/kanboard を開けば使用できます!

source: How to synchronize translation files?
ja: 翻訳ファイルを同期するには？

source: Other examples of `filters for Active Directory <http://social.technet.microsoft.com/wiki/contents/articles/5392.active-directory-ldap-syntax-filters.aspx>`__
ja: その他の例は `filters for Active Directory <http://social.technet.microsoft.com/wiki/contents/articles/5392.active-directory-ldap-syntax-filters.aspx>`__ を参照願います。

source: Asset Hooks -----------
ja: アセットのフック -----------

source: PHP Extensions Required ~~~~~~~~~~~~~~~~~~~~~~~
ja: 必要なPHP 拡張 ~~~~~~~~~~~~~~~~~~~~~~~

source: // LDAP DN for managers // Example: CN=Kanboard Managers,CN=Users,DC=kanboard,DC=local define('LDAP_GROUP_MANAGER_DN', '');
ja: // マネージャーのLDAP 識別名 // Example: CN=Kanboard Managers,CN=Users,DC=kanboard,DC=local define('LDAP_GROUP_MANAGER_DN', '');

source: Create a new custom role '''''''''''''''''''''''''''
ja: 独自の役割を作成する '''''''''''''''''''''''''''

source: Generate redirect link: ~~~~~~~~~~~~~~~~~~~~~~~
ja: リダイレクトのリンクを生成する: ~~~~~~~~~~~~~~~~~~~~~~~

source: Hooks executed only once ~~~~~~~~~~~~~~~~~~~~~~~~
ja: フックを一度だけ実行する ~~~~~~~~~~~~~~~~~~~~~~~~

source: // Header name to use for the username
ja: // ユーザー名に使用するヘッダ名

source: Optional PHP extensions ~~~~~~~~~~~~~~~~~~~~~~~
ja: 追加の PHP 拡張 ~~~~~~~~~~~~~~~~~~~~~~~

source: - PHPUnit installed
ja: - PHPUnit がインストールされていること

source: Automated Tests ===============
ja: 自動テスト ===============

source: Make sure the directory ``data`` is writeable by your web server user 6.
ja: ``data`` ディレクトリをwebサーバのユーザーが書き込みできるようにする 6.

source: That can be useful if your SMTP server configuration doesn’t accept the default address.
ja: SMTPサーバーの設定がデフォルトのアドレスを受け付けない場合に便利です。

source: - Purpose: **Get the opposite link id of a task link**
ja: - 用途: **タスク間リンクのリンク先を取得する**

source: Column API Procedures =====================
ja: カラムの API プロシージャ =====================

source: // Lock account duration in minute
ja: // アカウントのロック期間(分)

source: Installing from ports ---------------------
ja: ports からインストールする ---------------------

source: The language will be set for all users.
ja: この言語設定は全てのユーザーに適用されます。

source: Category API Procedures =======================
ja: カテゴリのAPIプロシージャ =======================

source: - The cycle time is time between the specified start date of the task to the completion date.
ja: - サイクルタイムは、「特定の開始日から、タスクが完了するまでの時間」です。

source: - Close dialog box = **ESC**
ja: - ダイアログボックスを閉じる= **ESC**

source: # install required packages
ja: # 必要なパッケージのインストール

source: - Purpose: **Update a user**
ja: - Purpose: **ユーザーをアップデートする**

source: - To install Beanstalk, you can simply use the package manager of your Linux distribution
ja: - Beanstalkのインストールは、単純に使用しているLinuxディストリビューションのパッケージマネージャーが利用できます。

source: You must call the API with a ``POST`` HTTP request.
ja: APIの呼び出しは ``POST`` HTTP リクエストで行わなければなりません。

source: From the task form, you can enter the desired tags:
ja: タスクのフォームから、希望するタグを入力できます:

source: Duplicate a task to another project ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: 別のプロジェクトにタスクを複製する ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: figure:: /_static/board-task-limit.png :alt: Board Task Limit
ja: figure:: /_static/board-task-limit.png :alt: ボードのタスク上限

source: Trigger for tasks ~~~~~~~~~~~~~~~~~
ja: タスクのトリガー ~~~~~~~~~~~~~~~~~

source: Project Calendar ~~~~~~~~~~~~~~~~
ja: プロジェクトのカレンダー ~~~~~~~~~~~~~~~~

source: - **priority** (integer, optional)
ja: - **priority** (integer, 任意)

source: - Purpose: **Get task by the external reference**
ja: - Purpose: **タスクを外部参照から取得する**

source: - Close a task in a specific column
ja: - 特定のカラムのタスクを完了させる

source: - Result on success: **List of swimlanes**
ja: - 成功時の返り値: **スイムレーンのリスト**

source: - **project_ids** (integer array, required)
ja: - **project_ids** (integer array, 必須)

source: Task Metadata API Procedures ============================
ja: タスクのメタデータのAPIのプロシージャ ===============================
